ID DIVISION.
PROGRAM-ID Ex1
ENVIRONMENT DIVISION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 THE-MESSAGE PIC XX[50].
01 THE-NUMBER PIC 9[20].
01 A-SPACE PIC X.


PROCEDURE DIVISION.
MOVE CORR" "TO A-SPACE.